
import employmentHistoryTimeline from "../charts/EmploymentHistoryTimeline.mmd";

export default {
    // 工作经历的时间线图表
    content_head: `
\`\`\`mermaid
${employmentHistoryTimeline}
\`\`\`
    ` ,
    list: [
        {
            "company_name": "上海烨芷劳务派遣有限公司",
            "start_time": "2022/12",
            "end_time": "至今",
            "position": "全栈工程师",
            "description": `---
**工作经历：全栈工程师(居家办公)**

> 当前公司为暂挂，居家办公。
- 开源项目 FlexiResume 多职位自定义简历生成器
- 开源项目 XCast 配置生成与转换工具

- 其他自研项目

---
`
        },
        {
            "company_name": "上海睿体网络科技有限公司",
            "start_time": "2018/07",
            "end_time": "2022/12",
            "position": "技术总监",
            "description": `
**工作经历：公司合伙人**

作为公司合伙人，我负责公司多个关键领域的开发工作，具体包括：
    
- **微信小游戏与Unity游戏开发：** 我深度参与了微信小游戏以及Unity游戏项目的开发工作，不仅在大型多人在线游戏、物理引擎对战游戏以及fps对战游戏中展现了卓越的技术实力，还确保了游戏的稳定性、流畅性和用户体验。
- 游戏后端核心算法研发：在游戏后端领域，我负责核心算法的开发工作，通过高效的数据处理和算法优化，提升了游戏的性能和响应速度，为玩家提供了更好的游戏体验。
- **大型HTML5多人在线游戏架构设计：** 我设计并开发了大型HTML5多人在线游戏架构，该架构实现了安卓、苹果和网页三端的无缝同步热更新，大大提升了游戏的跨平台兼容性和用户体验。
公司网络与运维管理：除了开发工作，我还负责公司网络和运维的管理工作，确保了公司所有系统的稳定运行和网络安全。
- **公司网站开发：** 我全面负责公司所有网站的开发工作，从需求分析、设计到编码、测试，全程参与并确保了网站的高质量交付。
- **DevOps业务部署与管理：** 我主导了公司\`DevOps\`相关业务的部署及管理，通过自动化、持续集成和持续交付等先进手段，提升了公司的开发效率和运维水平。

*值得一提的是，公司在多个大型项目中，我都是主导者并负责核心开发工作，通过我的技术领导力和团队协作能力，确保了项目的成功实施和交付。这些项目不仅展现了我在游戏开发领域的深厚功底，也证明了我在项目管理和团队协作方面的卓越能力。*

---
`
        },
        {
            "company_name": "上海淘米网络科技有限公司",
            "start_time": "2015/10",
            "end_time": "2018/06",
            "position": "前端主管",
            "description": `
**工作经历：赛尔号H5版项目前端负责人**

#### 项目概述
- **项目类型**：赛尔号H5版的同步开发，覆盖Android、iOS及PC三端，旨在提供无缝的游戏体验。

#### 核心职责
- **技术核心**：全面负责项目的技术难题攻克、架构设计及技术选型，确保项目顺利进行。
- **系统构建**：设计并实现地图、寻路、角色、装扮、宠物等核心系统，保证游戏的稳定性与可扩展性。
- **项目领导**：作为项目的主程兼主管，负责项目整体规划与团队协作，确保项目高效推进。

#### 项目成就
- **持续使用的应用**：2016年打包的应用至今仍然正常使用，具备增量热更新功能，保证了内容的持续迭代与优化。
- **用户受欢迎的项目**：该项目成为公司用户最受欢迎、盈利最好的项目之一，显著提升了公司的市场竞争力。
- **技术突破**：成功突破H5玩家同屏在线的瓶颈，优化了动画播放的效率和质量，提升了协作效率，有效解决了多人在线场景下的性能问题。
---

 `
        },
        {
            "company_name": "上海越游网络科技有限公司",
            "start_time": "2012/10",
            "end_time": "2015/10",
            "position": "前端主程",
            "description": `
**工作经历：创业合伙人**
> 作为创业合伙人，我主导了名为“混沌之怒（Chaos Rage）”的项目，该项目专注于海外市场，并主要通过Facebook等平台进行发行。
    
**我的主要职责与贡献包括：**

- **项目整体架构设计：** 我负责规划并设计了项目的整体架构，确保了系统的稳定性、可扩展性和安全性。这一环节是项目成功的基石，为后续的开发和运营提供了坚实的基础。
- **核心开发与技术领导：** 我不仅亲自参与了开发工作，还担任了主程的角色，带领团队攻克了多个技术难关。项目的大多核心模块都是我亲自开发完成的，这体现了我在技术领域的深厚功底和创新能力。
- **公司官网设计与开发：** 除了项目本身，我还负责公司官网的设计与开发工作。通过精心策划和设计，我打造了一个符合公司形象、易于用户访问和导航的官方网站，为公司的品牌传播和业务拓展提供了有力支持。

*在整个项目过程中，我充分发挥了自己的技术专长和领导力，带领团队高效推进项目，最终实现了项目的成功上线和运营。我的贡献不仅体现在技术层面，还包括对项目整体战略的把握和团队管理的优化。*

---
`
        },
        {
            "company_name": "上海淘米网络科技有限公司",
            "start_time": "2007/11",
            "end_time": "2012/10",
            "position": "前端主管",
            "description": `
**《摩尔庄园》项目主程兼主管**

#### 项目简介
> 《摩尔庄园》是一款专为儿童打造的虚拟乐园，基于Flex开发，以“健康、快乐、创造、分享”为核心理念，让小玩家化身小鼹鼠摩尔，享受音乐、舞蹈、社交及宠物养育的乐趣。

#### 核心职责
- **项目主程兼主管**：全面负责《摩尔庄园》大型多人在线游戏社区项目的开发，确保项目按照周开发节奏顺利推进。
- **多项目协助**：协助开发其他项目（如赛尔号、小花仙等），为团队提供技术支持与解决方案。
- **核心系统开发**：主导多个核心系统的开发，包括：
    - 地图标准模型制作
    - 地图系统
    - 角色系统
    - 寻路系统
    - 底层通信协议
    - 众多社区内独立小游戏开发

#### 团队规模
- 领导前端开发团队(《摩尔庄园》)，团队规模为7-15人，负责团队管理与协作优化。

#### 核心贡献
- 作为项目主程兼主管，自企业初创阶段加入，负责技术选型与落地实施，确保游戏顺利上线。
- 《摩尔庄园》成为公司首款最高同时在线人数超过100万的项目，为公司的后续上市奠定了坚实基础。
- 参与多款游戏的设计架构，为公司的产品多样化与市场拓展做出贡献。
- 公司陆续推出了《赛尔号》、《小花仙》、《功夫派》、《摩尔勇士》等多个热门游戏，我在这些项目中积极参与并提供横向支持，助力团队的整体发展与协作。
- 见证并参与公司上市的全过程，推动了项目的成功与行业影响力，成为业界标杆，带动多家企业模仿与跟随。
---
 `
        },
        {
            "company_name": "上海赤兔网络科技有限公司",
            "start_time": "2006/11",
            "end_time": "2007/11",
            "position": "前端主程",
            "description": `
**工作经历：3D社区多人在线游戏项目主程（网页游戏先驱）**

**项目亮点**  
> 引领开发了一款3D社区多人在线游戏，玩家可在其中享受生活模拟、即时聊天、音乐歌唱等多元化体验。

**角色定位**  
> *作为项目主程，我不仅负责技术架构设计与核心功能实现，还是网页游戏时代首批开发者之一，拥有丰富的行业经验和前瞻视野。*

- **核心模块开发**：完成了多个核心模块的开发，包括地图标准制定、角色控制、角色与底图深度交换算法等，推动项目顺利进展。
- **创新功能实现**：实现好友列表和小屋系统，支持伪3D建筑的深度堆叠，如桌子上可摆放凳子，并保存后渲染其深度层级和可行走区域。
---
 `
        },
        {
            "company_name": "上海精品网络有限公司",
            "start_time": "2005/08",
            "end_time": "2006/08",
            "position": "前端主程",
            "description": `
**工作经历：网站制作与维护**

**核心职责**  
- **网站制作与维护**：负责网站的整体制作和日常维护，确保网站的正常运行和稳定性。
- **动画制作**：主导Flash动态网页设计与编程，包括网页广告和网站进入动画设计，增强用户体验。
- **网页及美工设计**：参与网页制作和美工设计，负责平面设计工作，如Logo、Banner和网站模板的制作。
- **后端开发**：开发ASP后台程序，保障网站的高效运行和维护，支持前端功能的实现。

**成就**  
- 成功完成多个动态网页项目，提升了用户互动体验和网站吸引力。
- 设计的平面作品得到了客户的高度评价，为品牌形象提升做出了积极贡献。
---
                    `
        },
        {
            "company_name": "力天网络有限公司",
            "start_time": "2004/07",
            "end_time": "2005/02",
            "position": "前端开发",
            "description": `
**工作经历：网站开发**

**核心职责**  
- **前端开发**：使用 HTML、CSS、JavaScript、ActionScript 2 、网页三剑客进行网站排版与 UI 界面设计，确保页面布局美观、用户体验友好。
- **后端开发**：运用 ASP和 XML 设计并实现网站部分后端功能。

**成就**  
- 成功实现多个项目的从概念到上线的全流程，提升了网站的访问量和用户满意度。
- 优化网站性能，确保在不同设备和浏览器上均能顺畅运行，提高了网站的兼容性和响应速度。

                    `
        }
    ]
}