/**
 * 外包任务项目数据模块
 * 统一为对象结构，包含 content_head 和 list
 */

export default {
    content_head: ``,
    list: [
    {
        name: '社区养成类',
        children: [
            {
                name: '赛尔号H5（2015年、支持多端发布、技术含量最高）',
                content: ` 
> 这款游戏是我**使用技术含量最高**的项目，涉及了**多端发布、后端服务器、CI/CD、多端打包、资源管理、热编译、EUI 配置界面生成、反射技术、硬链接技术、性能、CDN策略、资源防劫持、Android和iOs资源增量热更**等。

> 值得一提的是，该游戏上线到现在近10年，Html5发展到如今很多**新技术已经成熟**，该游戏从**画质到流畅度**还有非常大的提升空间。

> ![图片](images/game/4/1.webp)  
> *基于 Egret 引擎开发。
开发这款游戏前我**已经拥有4款社区架构经验**（抱抱城前身、抱抱城、摩尔庄园1、摩尔庄园2），在此再度升级架构细节，为了支持超大型社区项目，我独立设计并实现了一整套类似 Webpack 的工具链，针对性地优化了项目的构建和资源管理。*
> ![图片](images/game/4/2.webp)  
> *在开发中，我采用了反射技术动态生成 EUI 配置界面，从而减少了配置文件的体积并提升了性能。
此外，整个项目支持热编译，极大提高了开发效率。*
> ![图片](images/game/4/3.webp)   
> *在项目架构设计方面，我将每个模块的资源、UI 源文件、发布资源和文档进行了严格的分离存储，并通过硬链接技术将相关资源关联到对应模块，进一步提升了工作流程效率。
该项目涉及到**多端打包**、**后端服务器**、**CI/CD**，综合考虑了前端、后端和运维的协同工作，以确保系统的高效运行和易于维护。*

<p align="center"> !QRCode:https://s.61.com size=200 </p> 
 <p align="center"> 
   <a href="https://s.61.com/" target="_blank">扫码体验 https://s.61.com/</a>
 </p>
`
            },
        ],
        content: ``,
    },
    ]
};